app/Models/UsersModel.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function getUserByUsername($username)
    {
        return $this->where('username', $username)->first();